app/controllers/obras_controller.rb

SELECT "obras".* FROM "obras"
---
  def index
    @obras = Obra.all

SELECT "obras".* FROM "obras" WHERE "obras"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @obra = Obra.find(params[:id])

SELECT "obras".* FROM "obras" WHERE "obras"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def edit
    @obra = Obra.find(params[:id])

INSERT INTO "obras" ("titulo", "autor", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["titulo", "El Aleph"], ["autor", "Jorge L.Borges"], ["created_at", "2020-09-02 02:15:42.736212"], ["updated_at", "2020-09-02 02:15:42.736212"]]
---
  def create
    @obra = Obra.new(obra_params)

    if @obra.save

SELECT "obras".* FROM "obras" WHERE "obras"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def update
    @obra = Obra.find(params[:id])

SELECT "obras".* FROM "obras" WHERE "obras"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "obras" WHERE "obras"."id" = ?  [["id", 1]]
---
  def destroy
    @obra = Obra.find(params[:id])
    @obra.destroy